{
    "articles": {
        "page": 1,
        "totalResults": 6947,
        "pages": 695,
        "results": [
            {
                "uri": "6770363346",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:58:00",
                "dateTime": "2021-10-15T23:58:00Z",
                "dateTimePub": "2021-10-15T22:51:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://www.forbes.com/sites/trevorclawson/2021/10/15/start-a-business-get-an-mscthe-university-that-wants-to-be-an-incubator/",
                "title": "Start A Business, Get An MSc - The University That Wants To Be An Incubator",
                "body": "I've been talking to Falmouth University Vice Chancellor, Professor Anne Carlisle for around half an hour when she casually mentions an objective that is genuinely startling. \"The whole university will be an incubator by 2030,\" she says.\n\nNow, there's nothing unusual about United Kingdom universities playing host to incubators and accelerators but they tend to represent just a small subset of campus activity. An ambition to create an incubator model that will encompass an entire institution - well, that's something new.\n\nBut Falmouth University - located in Cornwall, one of England's most economically deprived counties - is on something of a mission to do more than simply turn out cohort after cohort of well-qualified students. The aim is to play an active role in reviving the local economy and business creation is an important part of that plan.\n\n\"The university has a role to play in encouraging recovery in a low wage economy,\" says Professor Carlisle. \"We can play a part in creating a tech cluster, creating jobs and bringing prosperity to the region.\"\n\nAn Added Incentive\n\nAnd one of the key initiatives to achieve that aim has been the creation of Launchpad, a largely tech-focused incubator that combines all the elements you would expect in a business development program, with the added incentive of an academic qualification - an MSc, to be precise - for those taking part in each cohort.\n\nAs Professor Carlisle explains, Launchpad has been specifically designed to create, develop and launch businesses that meet clearly defined market needs, with alumni committing to remaining in Cornwall for at least five years after completing the program. It's hoped that a practical and market-led approach to creating new companies will not only deliver success to the entrepreneurial teams but also create much-needed high-paid jobs in the area.\n\nIn some respects, Falmouth University's Launchpad reflects a model developed in the U.K. by Entrepreneur First, in that teams are brought together without necessarily having business-creation ideas of their own.\n\nInstead, real-world challenges are set by industry partners such as interactive live-streaming service, Twitch, Sony, Green Man Gaming and the National Health Service. \"The teams are put together to solve those challenges,\" says Professor Carlisle.\n\nNow it has to be said that Falmouth is not a specialist technology institution. In fact, it started out as a School of Art and today its focus is on the arts and creative industries. So how does an tech incubator fit into that legacy?\n\nWell, Launchpad was set up to attract post-graduate students with an interest in business creation and as Professor Carlisle explains, it attracts well-qualified people from all over the country. Some have a background in tech. Others may be more interested in management or sales.\n\nAdded to that is the fact that from gaming to film production, the creative industries are themselves technology hungry and business savvy. This is reflected within the university. So, while you can certainly study acting or comedy scriptwriting at Falmouth, you can also - for example - learn to code, study Artificial Intelligence for Games, or take a management degree.\n\nGetting Creative\n\nThe creative side of the equation is important. Professor Carlisle sees the incubator as having particular strengths in areas such as the commercial exploitation of immersive technology. She also stresses the importance of deploying creativity in service of a broad range of businesses concepts. \"It's what we call the creative bridge,\" she says.\n\nThe creation of new businesses within the incubator involves a number of stages. Initially, the market is identified and validated. Talent is recruited to take the businesses forward. At some stage, cohort members are likely to learn about pivoting. Finally, if all goes well, businesses are incorporated. To date, 38 companies have been incorporated.\n\nThe companies emerging from incubator thus far cover a fairly wide range of products and sectors. To take a few examples, Constructiv has developed an app to aid the recruitment of construction workers; Data Duopoloy has developed tools to identify and ease congestion at visitor attractions; and Meatfreed is a community for people seeking alternative sources of protein.\n\nFunding\n\nBut will funding be available. For those unfamiliar with the geography of the UK, Cornwall sits on the South Western Edge of Britain at the end of a peninsula jutting out into the Atlantic. It is a long way from London and its growing community of VCs. It's also some distance from the increasingly important tech cluster surrounding Bristol and Bath. So where does the investment come from, given that VCs can be quite narrow in their geographical focus?\n\nTo some extent, that's where the partners come in. \"We would hope that a lot of the investment would come from the industry partners, says Professor Carlisle. She cites Codices. The company develops interactivity tools for online broadcasters and was invested in by Twitch.\n\nThe common theme at Falmouth's launchpad is a combination of creativity, business acumen and technology, all of which arguably sits fairly easily with the university's origins and current focus. It will be interesting to see how far and how fast the institution moves towards embedding the incubator model across a wider range of courses.",
                "source": {
                    "uri": "forbes.com",
                    "dataType": "news",
                    "title": "Forbes"
                },
                "authors": [],
                "image": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F616948ba72332051190c4793%2F0x0.jpg",
                "eventUri": null,
                "sentiment": 0.3176470588235294,
                "wgt": 372038280,
                "relevance": 1
            },
            {
                "uri": "6770360618",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:53:00",
                "dateTime": "2021-10-15T23:53:00Z",
                "dateTimePub": "2021-10-15T23:53:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://www.beckershospitalreview.com/payer-issues/empire-bluecross-ceo-president-innovation-starts-with-consumer-demand.html",
                "title": "Empire BlueCross CEO, president: Innovation starts with consumer demand",
                "body": "The COVID-19 pandemic forced healthcare out of both its macro- and micro-level comfort zones, driving payers to meet consumer demands with innovative solutions, Alan Murray, CEO and president of Empire BlueCross, wrote in an Oct. 15 piece for the Albany Inno.\n\nEarly on, this shift was embodied by Empire BlueCross' adjustment from using its virtual LiveHealthOnline solution for urgent health needs to using it to broaden specialty care horizons.\n\nThe same is true for deepening Anthem Link, a technology-enabled solution for small businesses that allows them to virtually manage health and wellness. The tool supports small businesses with artificial intelligence-driven symptom-checking, digital action plans, online coaching and more.\n\nMuch of that development comes from enhancing digital integration, Murray wrote. Empire BlueCross is pushing for 80 percent of members to be connected to the payer through admission and discharge notifications and for medical record access by the end of 2022.",
                "source": {
                    "uri": "beckershospitalreview.com",
                    "dataType": "news",
                    "title": "Hospital Review"
                },
                "authors": [
                    {
                        "uri": "nick_moran@beckershospitalreview.com",
                        "name": "Nick Moran",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": "https://www.beckershospitalreview.com/templates/beckers/assets/images/bhr-og-image.png",
                "eventUri": null,
                "sentiment": 0.3960784313725489,
                "wgt": 372037980,
                "relevance": 1
            },
            {
                "uri": "6770356226",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:45:00",
                "dateTime": "2021-10-15T23:45:00Z",
                "dateTimePub": "2021-10-15T23:45:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://venturebeat.com/2021/10/15/report-76-of-manufacturers-plan-to-adopt-private-5g-by-2024/",
                "title": "Report: 76% of manufacturers plan to adopt private 5G by 2024",
                "body": "The potential for 5G to completely transform industries is immeasurable. By promising decreased latency, enhanced security, and the ability to support artificial intelligence (AI) and augmented reality (AR), sectors like health care, gaming, and emergency services will be forever altered. But those opportunities are still far in the future. Most industries and the majority of enterprises aren't yet equipped with the right infrastructure to support 5G. The major exception is manufacturing. As an industry almost entirely dependent on the successful connections between machines, manufacturing is ripe to adopt 5G. But that's only true if their IT teams are equipped with the right knowledge, skills, tools, and the ecosystem of service providers and technology vendors that can provide the tools and support to make individual visions of Industry 4.0 a reality.\n\nTo understand manufacturing teams' readiness for 5G, Accedian, a provider of performance analytics, cybersecurity threat detection, and end-user experience solutions, partnered with Analysys Mason on a new study of 5G adoption trends. The result was overwhelmingly positive: More than three-fourths (76%) of respondents are planning to adopt private 5G networks by 2024, and list the benefits of increased network security (63%), network performance (49%), and application performance (45%) as a few of the key reasons why.\n\nBut respondents also pointed out a few challenges that have impeded their adoption process thus far, such as the increased complexity of managing the network (43%). This is where service providers have a part to play, particularly in moving from being solely a vendor to becoming more of a strategic partner throughout the 5G adoption process. It's with this collaborative mindset that the promise of 5G in manufacturing will become a reality, and usher in Industry 4.0.\n\nAnalysys Mason, a management consultancy focused on technology, media, and telecommunications (TMT), surveyed 200 respondents from Germany, Japan, United Kingdom, and the United States across six verticals to gain insight into private 5G adoption.",
                "source": {
                    "uri": "venturebeat.com",
                    "dataType": "news",
                    "title": "VentureBeat"
                },
                "authors": [],
                "image": "https://venturebeat.com/wp-content/uploads/2021/08/technology-4816658-e1634225099414.jpg?w=1200&strip=all",
                "eventUri": null,
                "sentiment": 0.388235294117647,
                "wgt": 372037500,
                "relevance": 1
            },
            {
                "uri": "6770349748",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:33:00",
                "dateTime": "2021-10-15T23:33:00Z",
                "dateTimePub": "2021-10-15T23:30:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://venturebeat.com/2021/10/15/ai-weekly-ai-model-training-costs-on-the-rise-highlighting-need-for-new-solutions/",
                "title": "AI Weekly: AI model training costs on the rise, highlighting need for new solutions",
                "body": "This week, Microsoft and Nvidia announced that they trained what they claim is one of the largest and most capable AI language models to date: Megatron-Turing Natural Language Generation (MT-NLP). MT-NLP contains 530 billion parameters -- the parts of the model learned from historical data -- and achieves leading accuracy in a broad set of tasks, including reading comprehension and natural language inferences.\n\nBut building it didn't come cheap. Training took place across 560 Nvidia DGX A100 servers, each containing 8 Nvidia A100 80GB GPUs. Experts peg the cost in the millions of dollars.\n\nLike other large AI systems, MT-NLP raises questions about the accessibility of cutting-edge research approaches in machine learning. AI training costs dropped 100-fold between 2017 and 2019, but the totals still exceed the compute budgets of most startups, governments, nonprofits, and colleges. The inequity favors corporations and world superpowers with extraordinary access to resources at the expense of smaller players, cementing incumbent advantages.\n\nFor example, in early October, researchers at Alibaba detailed M6-10T, a language model containing 10 trillion parameters (roughly 57 times the size of OpenAI's GPT-3) trained across 512 Nvidia V100 GPUs for 10 days. The cheapest V100 plan available through Google Cloud Platform costs $2.28 per hour, which would equate to over $300,000 ($2.28 per hour multiplied by 24 hours over 10 days) -- further than most research teams can stretch.\n\nGoogle subsidiary DeepMind is estimated to have spent $35 million training a system to learn the Chinese board game Go. And when the company's researchers designed a model to play StarCraft II, they purposefully didn't try multiple ways of architecting a key component because the training cost would have been too high. Similarly, OpenAI didn't fix a mistake when it implemented GPT-3 because the cost of training made retraining the model infeasible.\n\nIt's important to keep in mind that training costs can be inflated by factors other than an algorithm's technical aspects. As Yoav Shoham, Stanford University professor emeritus and cofounder of AI startup AI21 Labs, recently told Synced, personal and organizational considerations often contribute to a model's final price tag.\n\n\"[A] researcher might be impatient to wait three weeks to do a thorough analysis and their organization may not be able or wish to pay for it,\" he said. \"So for the same task, one could spend $100,000 or $1 million.\"\n\nStill, the increasing cost of training -- and storing -- algorithms like Huawei's PanGu-Alpha, Naver's HyperCLOVA, and the Beijing Academy of Artificial Intelligence's Wu Dao 2.0 is giving rise to a cottage industry of startups aiming to \"optimize\" models without degrading accuracy. This week, former Intel exec Naveen Rao launched a new company, Mosaic ML, to offer tools, services, and training methods that improve AI system accuracy while lowering costs and saving time. Mosaic ML -- which has raised $37 million in venture capital -- competes with Codeplay Software, OctoML, Neural Magic, Deci, CoCoPie, and NeuReality in a market that's expected to grow exponentially in the coming years.\n\nIn a sliver of good news, the cost of basic machine learning operations has been falling over the past few years. A 2020 OpenAI survey found that since 2012, the amount of compute needed to train a model to the same performance on classifying images in a popular benchmark -- ImageNet -- has been decreasing by a factor of two every 16 months.\n\nApproaches like network pruning prior to training could lead to further gains. Research has shown that parameters pruned after training, a process that decreases the model size, could have been pruned before training without any effect on the network's ability to learn. Called the \"lottery ticket hypothesis,\" the idea is that the initial values parameters in a model receive are crucial for determining whether they're important. Parameters kept after pruning receive \"lucky\" initial values; the network can train successfully with only those parameters present.\n\nNetwork pruning is far from a solved science, however. New ways of pruning that work before or in early training will have to be developed, as most current methods apply only retroactively. And when parameters are pruned, the resulting structures aren't always a fit for the training hardware (e.g., GPUs), meaning that pruning 90% of parameters won't necessarily reduce the cost of training a model by 90%.\n\nWhether through pruning, novel AI accelerator hardware, or techniques like meta-learning and neural architecture search, the need for alternatives to unattainably large models is quickly becoming clear. A University of Massachusetts Amherst study showed that using 2019-era approaches, training an image recognition model with a 5% error rate would cost $100 billion and produce as much carbon emissions as New York City does in a month. As IEEE Spectrum's editorial team wrote in a recent piece, \"we must either adapt how we do deep learning or face a future of much slower progress.\"",
                "source": {
                    "uri": "venturebeat.com",
                    "dataType": "news",
                    "title": "VentureBeat"
                },
                "authors": [
                    {
                        "uri": "kyle_wiggers@venturebeat.com",
                        "name": "Kyle Wiggers",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": "https://venturebeat.com/wp-content/uploads/2018/07/AI-2.jpg?w=1200&strip=all",
                "eventUri": null,
                "sentiment": 0.192156862745098,
                "wgt": 372036780,
                "relevance": 1
            },
            {
                "uri": "p-6770347320",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:32:00",
                "dateTime": "2021-10-15T23:32:00Z",
                "dateTimePub": "2021-10-15T23:31:00Z",
                "dataType": "pr",
                "sim": 0,
                "url": "https://www.homelandsecuritynewswire.com/dr20211015-growing-the-u-s-ai-workforce",
                "title": "Growing the U.S. AI Workforce",
                "body": "A new policy brief Georgetown University's Center for Security and Emerging Technology (CSET) addresses the need for a clearly defined artificial intelligence education and workforce policy. The brief provides recommendations designed to grow, sustain, and diversify the U.S. AI workforce. The authors employ a comprehensive definition of the AI workforce -- technical and nontechnical occupations -- and provide data-driven policy goals. They note that their recommendations are designed to leverage opportunities within the U.S. education and training system while mitigating its challenges, and prioritize equity in access and opportunity to AI education and AI careers.\n\nHere is the brief's Executive Summary:\n\nThe U.S. artificial intelligence workforce, which stood at 14 million people in 2019, or 9 percent of total U.S. employment, has grown rapidly in recent years. This trend is likely to continue, as AI occupational employment over the next decade is projected to grow twice as fast as employment in all occupations.\n\nSuch an important and increasing component of the U.S. workforce demands dedicated education and workforce policy. Yet one does not exist. To date, U.S. policy has been a piecemeal approach based on inconsistent definitions of the AI workforce. For some, current policy is focused on top-tier doctorates and immigration reform. For others, the conversation quickly reverts to STEM education.\n\nThis report addresses the need for a clearly defined AI education and workforce policy by providing recommendations designed to grow, sustain, and diversify the domestic AI workforce. We use a comprehensive definition of the AI workforce--technical and nontechnical occupations--and provide data-driven policy goals.\n\nOur policy goals and recommendations build off of previous CSET research along with new research findings presented here. Previous research in this series defined the AI workforce, described and characterized these workers, and assessed the relevant labor market dynamics. For example, we found that the demand for computer and information research scientists appears to be higher than the current supply, while for software developers and data scientists, evidence of a supply-demand gap is mixed.\n\nTo understand the current state of U.S. AI education for this report, we manually compiled an \"AI Education Catalog\" of curriculum offerings, summer camps, after-school programs, contests and challenges, scholarships, and related federal initiatives. To assess the current landscape of employer demand and hiring experiences, we also interviewed select companies engaged in AI activities.",
                "source": {
                    "uri": "homelandsecuritynewswire.com",
                    "dataType": "pr",
                    "title": "homelandsecuritynewswire.com"
                },
                "authors": [],
                "image": null,
                "eventUri": null,
                "sentiment": 0.3176470588235294,
                "wgt": 372036720,
                "relevance": 2
            },
            {
                "uri": "6770343849",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:26:00",
                "dateTime": "2021-10-15T23:26:00Z",
                "dateTimePub": "2021-10-15T23:25:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://foreignaffairs.co.nz/2021/10/16/mil-osi-russia-military-attaches-at-the-finnish-embassy-visited-the-avangard-center/",
                "title": "MIL-OSI Russia: Military attachés at the Finnish Embassy visited the Avangard Center",
                "body": "Military attachés at the Finnish Embassy visited the Avangard educational and methodological center for military-patriotic education of youth. For them, the director of the complex, Daria Borisova, conducted a sightseeing tour, during which she spoke in detail about the activities of the center, its technical capabilities and modern approaches to youth education used here.\n\nThe representatives of Finland examined the administrative and educational, children's residential and sports buildings of the center. In the classrooms of the Airborne Forces and the Strategic Missile Forces, they tested their basic military training skills. So, with the help of simulators, the guests \"jumped with a parachute\", \"rode a combat vehicle\", \"fired from a weapon\".\n\nThe delegation also appreciated the center's own developments: the artificial intelligence of Avangard and Russia's first certified online platform in the field of military-patriotic education of youth.\n\nAccording to Daria Borisova, the visit of the Finnish delegation to Avangard will be the beginning of strong friendship and cooperation in the field of military-patriotic education of the younger generation.\n\n\"Our main principle is that education must keep pace with the times. Our center concentrates advanced technologies, the experience of several generations of Russian military personnel and the most modern approaches to training. We are glad that gradually they will learn about our center not only in Russia, but also abroad. And today we are glad to receive military attachés at the Finnish Embassy on defense issues and to conduct a dialogue on an important topic - the matter of educating the younger generation, \"said Daria Borisova.\n\n1 2 3 4 5\n\nEDITOR'S NOTE: This article is a translation. Apologies should the grammar and / or sentence structure not be perfect.",
                "source": {
                    "uri": "foreignaffairs.co.nz",
                    "dataType": "news",
                    "title": "foreignaffairs.co.nz"
                },
                "authors": [
                    {
                        "uri": "mil_osi_publisher@foreignaffairs.co.nz",
                        "name": "Mil-Osi Publisher",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": null,
                "eventUri": null,
                "sentiment": 0.1529411764705881,
                "wgt": 372036360,
                "relevance": 1
            },
            {
                "uri": "6770335577",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:12:00",
                "dateTime": "2021-10-15T23:12:00Z",
                "dateTimePub": "2021-10-15T23:11:00Z",
                "dataType": "news",
                "sim": 0.6784313917160034,
                "url": "https://screenrant.com/legends-tomorrow-human-gideon-100th-episode-setup-explained/",
                "title": "What Legends of Tomorrow's Gideon Twist Means For The 100th Episode",
                "body": "Warning: The following contains SPOILERS for Legends of Tomorrow's season 7 premiere.\n\nGideon, the artificial intelligence that runs the Waverider on Legends of Tomorrow, was restored to life in the season 7 premiere, setting up the series' 100th episode, which will be told from her perspective. Usually presented as a holographic head, Gideon had previously only appeared \"in the flesh\" on Legends of Tomorrow in dream sequences and hallucinations; however, a magical mishap in the episode \"The Bullet Blondes\" gave Gideon a true physical form for the first time.\n\nDespite being the only original member of the Legends left on the series besides co-captain Sara Lance, Gideon is often overlooked. Reportedly created by Barry Allen as a digital assistant at some point in the future before being downloaded into a time-ship, Gideon rarely needs to speak up and make her presence known. Beyond running the higher functions of the Waverider, Gideon helped the Legends to restore Rip Hunter's memories after he was brainwashed by the Legion of Doom and assisted Zari Tomaz in breaking a time-loop that had trapped the team in the Legends of Tomorrow season 3 episode \"Here I Go Again.\"\n\nGideon was apparently destroyed forever in the Legends of Tomorrow season 6 finale after the Waverider was blown up by another time-ship. This left the Legends stranded in Odessa, Texas in the year 1925 with no apparent hope of rescue. This pushed Astra Logue to try and rebuild the Waverider using a resurrection spell she had learned from her mentor, John Constantine. The spell proved to be more than Astra could handle and the effort caused her to pass out before she could finish her incantation. However, when she later said the last word of the spell while talking with her best friend, Spooner Cruz, the residual magic sparked something in the Waverider wreckage, and a naked woman emerged from the rubble.\n\nGideon's resurrection and transformation comes in anticipation of Legends of Tomorrow's 100th episode, which is titled \"wvrdr_error_100 not found.\" Little is known about the episode's story beyond the fact that it will be told from Gideon's perspective and feature flashbacks to all the incarnations of the Legends of Tomorrow over the past six seasons. Logically, this makes sense, as Gideon was the only person who was there for everything that ever happened to the Legends, beginning with Time Master Rip Hunter going rogue, stealing a time-ship and recruiting eight people to help him kill the immortal supervillain destined to kill his family and conquer the Earth.\n\nRip Hunter will be one of many former Legends returning for a cameo in the Legends of Tomorrow 100th episode anniversary special. However, it is still unclear if Gideon's newfound humanity will be a permanent condition or if she'll be restored to her snarky synthetic form at some point in the future. In either case, mechanical lifeforms coping with humanity is one of the few science fiction tropes that Legends of Tomorrow has yet to satirize, so it seems likely that Gideon will be struggling with her new form for some time to come.\n\nMore: What Night Batwoman & Legends Of Tomorrow Air Now (New Time Slot Explained)\n\nShare Share Tweet Email 0 Comment Related Topics TV News SR Originals About The Author Matt Morrison (1667 Articles Published)\n\nMatt Morrison has been writing about comics since before the word \"blogging\" was coined. He got his start writing for the legendary DC Comics digital fanzine Fanzing, before receiving his own column, The Mount. Since then he has gone on to write for over a dozen websites, including 411 Mania, Comics Nexus and The Cult of Nobody. He holds both an MS in Information Science from the University of North Texas and a BFA from the University of Texas at Arlington. Known as a font of comic book history trivia, he has delivered lectures on the history of American Comic Books, Japanese Manga, Doctor Who, and Cosplay at over a dozen conventions and served as an Expert In-Residence for a course on Graphic Novels for Librarians at the University of North Texas. In addition to his work for Screen Rant, Matt is currently the Editor In Chief of Kabooooom.com and writes reviews for No Flying, No Tights - a graphic literature and anime review site aimed at teachers and librarians. He also maintains a personal blog - My Geeky Geeky Ways - which hosts his extensive episode guide for the television series making up The Arrowverse as well as his comedic Let's Play videos. What little spare time he has is devoted towards acting, role-playing, movie-riffing and sarcasm. You can follow his adventures on Twitter, @GeekyGeekyWays.\n\nMore From Matt Morrison",
                "source": {
                    "uri": "screenrant.com",
                    "dataType": "news",
                    "title": "ScreenRant"
                },
                "authors": [],
                "image": "https://static2.srcdn.com/wordpress/wp-content/uploads/2021/10/Legends-of-Tomorrow-season-7-Gideon.jpg",
                "eventUri": "eng-7178879",
                "sentiment": 0.1058823529411765,
                "wgt": 372035520,
                "relevance": 1
            },
            {
                "uri": "p-6770334253",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:09:00",
                "dateTime": "2021-10-15T23:09:00Z",
                "dateTimePub": "2021-10-15T21:33:00Z",
                "dataType": "pr",
                "sim": 0,
                "url": "https://www.globenewswire.com/news-release/2021/10/15/2315226/0/en/Consumer-Alert-Lowey-Dannenberg-P-C-Investigates-Claims-Against-Insurance-Company-Lemonade-Inc-LMND.html",
                "title": "Consumer Alert: Lowey Dannenberg, P.C., Investigates Claims Against Insurance Company, Lemonade, Inc. (LMND)",
                "body": "NEW YORK, Oct. 15, 2021 (GLOBE NEWSWIRE) -- Lowey Dannenberg P.C., a preeminent law firm in obtaining redress for consumers and investors, is investigating consumer claims for violation of consumer protection statutes by Lemonade, Inc. (\"Lemonade\" or the \"Company\").\n\nIf you are a Lemonade customer and have submitted a video to Lemonade to make an insurance claim, you should contact Lowey Dannenberg attorneys at (914) 733-7256 or via email at investigations@lowey.com.\n\nLemonade is an internet-based insurance company that offers renters' insurance, homeowners' insurance, pet insurance and term life insurance in United States and in part of Europe. The Company uses artificial intelligence to open policies and process customers' claims.\n\nTo submit a claim, Lemonade customers record a video of themselves, which they submit to Lemonade for processing. On May 26, 2021, Lemonade tweeted that the recordings consumers make are analyzed for fraud by artificial intelligence to \"pick up non-verbal cues that traditional insurers can't.\"\n\nOur investigation concerns whether Lemonade's practice of collecting, using, and storing customers' biometric information without consent, violates consumers' protection laws of various states.\n\nIf you are a Lemonade customer and submitted a video of yourself to Lemonade, you may have legal claims against the Company. To participate, learn more, or discuss the issues surrounding the investigation, please contact our attorneys at (914) 733-7256 or via email at investigations@lowey.com.\n\nAbout Lowey Dannenberg\n\nLowey Dannenberg is a national firm representing institutional and individual investors, public funds, organizations, and other entities, who suffered financial losses resulting from corporate fraud and malfeasance in violation of federal securities and antitrust laws, and consumer protection laws. The firm has significant experience in prosecuting multi-million-dollar lawsuits and has previously recovered billions of dollars on behalf of its clients.\n\nContact\n\nLowey Dannenberg P.C.\n\n44 South Broadway, Suite 1100\n\nWhite Plains, NY 10601\n\nTel: (914) 733-7256\n\nEmail: investigations@lowey.com",
                "source": {
                    "uri": "globenewswire.com",
                    "dataType": "pr",
                    "title": "GlobeNewswire Press Releases"
                },
                "authors": [],
                "image": "https://ml.globenewswire.com/Resource/Download/38c8d81f-4a6b-4f23-8411-e6be6a60dda1?size=1",
                "eventUri": null,
                "sentiment": 0.1058823529411765,
                "wgt": 372035340,
                "relevance": 2
            },
            {
                "uri": "6770322251",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "22:50:00",
                "dateTime": "2021-10-15T22:50:00Z",
                "dateTimePub": "2021-10-15T22:11:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://ussanews.com/News1/2021/10/15/no-cnn-wildfires-will-not-be-destroying-times-square-new-york-city/",
                "title": "No, CNN, Wildfires Will Not Be Destroying Times Square, New York City",
                "body": "CNN published an article yesterday titled, \"This website helps you imagine what extreme climate change will do to your home.\" According to CNN, a new website delivers \"a surprisingly realistic sense of what it could look like\" if your home address is struck by the ravages of climate change. To illustrate its point, CNN provided an Artificial Intelligence-manipulated photo of New York City's Times Square engulfed in wildfire smoke.\n\nNewsflash - wildfires have not engulfed New York City any time since SUVs were invented, nor will wildfires ever engulf New York City. Even if wildfires ever do engulf some area within hundreds of miles of New York City, the wildfires would almost certainly have been started by arsonists than climate change.\n\nIf we are going to talk about global warming and any alleged consequences, we have to look at global data. Although this past year has seen more wildfires than usual in California, with climate activists and their media sock puppets blaming global warming, NASA satellite instruments have been measuring the amount of land burned globally by wildfires since the 1990s. According to NASA, lands burned by wildfires have decreased by 24 percent since the satellite measurements first began.\n\nWildfires have always occurred on this planet and always will. When wildfires substantially decline as temperatures modestly warm - in conjunction with more precipitation and a greening of the Earth with more vegetation - it is counterfactual and dishonest to point to the fewer wildfires that still occur and claim that global warming is causing those that still occur.\n\nNo, CNN, wildfires are not destroying New York City, nor will they ever do so.",
                "source": {
                    "uri": "ussanews.com",
                    "dataType": "news",
                    "title": "USSA News"
                },
                "authors": [
                    {
                        "uri": "constitutional_nobody@ussanews.com",
                        "name": "Constitutional Nobody",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": "https://climaterealism.com/wp-content/uploads/2021/10/Times-Square-pixabay-1-1024x682.jpg",
                "eventUri": null,
                "sentiment": 0.04313725490196085,
                "wgt": 372034200,
                "relevance": 1
            },
            {
                "uri": "6770321139",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "22:47:00",
                "dateTime": "2021-10-15T22:47:00Z",
                "dateTimePub": "2021-10-15T22:00:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://www.intellasia.net/webinar-on-healthcare-innovations-for-sustainable-future-by-kalkine-media-on-october-21-2021-971748",
                "title": "Webinar on Healthcare Innovations for Sustainable Future by Kalkine Media on October 21, 2021",
                "body": "SYDNEY, Oct. 16, 2021 /PRNewswire/ -- Ensuring healthy lives and promoting physical and mental well-being is essential to sustainable development. Currently, the world is facing a global health crisis unlike any other. Global health has increasingly gained international visibility and prominence. From big data to precision medicine, the recent advances in biomedical research have swept away the conventional approach to medical science. The availability of large volumes of digitised clinical data, combined with powerful artificial intelligence (AI) algorithms, are proving to be the real gamechangers.\n\nGet insights on Healthcare Innovations from three of our valued clients, who are leaders in the Australian healthcare and biotech space. Managing Director and Chief Executive Officer of Cynata Therapeutics Limited - Dr Ross Macdonald, Executive Chair and CEO of Invion Limited - Mr. Thian Chew, and CEO & Managing Director of PainChek Limited Mr. Philip Daffas.\n\nThe webinar will help potential investors get a sense of how the healthcare sector looks like in the future in an exclusive Invest Nest Webinar by Kalkine Media.\n\nCynata Therapeutics Limited is an Australian-based clinical-stage stem cell and regenerative medicine company, based in Cubitt Street, Cremorne, Victoria. The Company focusses on the development of therapies based on its unique Cymerus™ technology. The Company's Cymerus™ technology is addressing a critical limitation in existing MSCs (mesenchymal stem cells) production methods for therapeutic use.\n\nAustralian life sciences company Invion Limited is dedicated to transforming Photodynamic Therapy (PDT) to develop innovative and effective cancer treatments. The firm is leading the global clinical development of PhotosoftTM technology, which is an improved next-generation Photodynamic Therapy.\n\nPainChek Limited engages in the development and commercialisation of mobile medical device applications. These device applications automate intelligent pain assessment of individuals who are unable to communicate their pain with carers. The journey of PainChek began in 2016. Since then, PainChek has come a long way with several core goals achieved. PainChek envisions to emerge as a leader in the market for innovative pain assessment products while providing services to help enhance the quality of life for people suffering from pain.\n\nAbout Kalkine Media\n\nKalkine Media operates across Australia, New Zealand, Canada, UK and the US. It aims to keep its readers abreast of the latest and trending news on the equity and commodity markets, the unravelling economy and other business developments.",
                "source": {
                    "uri": "intellasia.net",
                    "dataType": "news",
                    "title": "IntellAsia"
                },
                "authors": [],
                "image": null,
                "eventUri": null,
                "sentiment": 0.1529411764705881,
                "wgt": 372034020,
                "relevance": 1
            }
        ]
    }
}