{
    "articles": {
        "page": 1,
        "totalResults": 36659,
        "pages": 3666,
        "results": [
            {
                "uri": "6770363840",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:59:00",
                "dateTime": "2021-10-15T23:59:00Z",
                "dateTimePub": "2021-10-15T23:33:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://newsday.co.tt/2021/10/15/late-drummer-percussionist-composer-peter-telfer-hailed-as-a-patriot/",
                "title": "Late drummer, percussionist, composer Peter Telfer hailed as a patriot - Trinidad and Tobago Newsday",
                "body": "PETER Telfer's infectious beat of the African drum has been silenced, but memories of his remarkable work lives on.\n\nTelfer, 63, died on Friday morning at the Arima General Hospital where he was receiving treatment for several weeks in the intensive care unit.\n\nDuring this time, Facebook was used as a medium for friends in the cultural community to channel positive vibes and pray for his recovery.\n\nOn Friday morning, many Facebook pages were filled with expressions of grief and sadness at his passing, and warm memories of those he touched along his life's journey.\n\nArchbishop Jason Gordon and Minister of Tourism, Culture and the Arts Randall Mitchell hailed him as a patriot.\n\nFor over four decades this cultural icon, who founded the Mawasi Experience, which celebrated its 41st anniversary three days ago, made worship service at local Roman Catholic churches an unforgettable spiritual and uplifting experience.\n\nParishioners at Sacred Heart RC, where he spent his latter years, welcomed the infectious beat of the African drums which he incorporated in the band.\n\nAlthough he was not formally trained in music, admitting in previous interviews he could not read a musical note, Telfer, best known as a drummer and percussionist, was a well-known composer who interjected his own spin on praise and worship songs.\n\nHe attributed this talent as a gift from God and used it to spread the message of love and humanity.\n\nA true patriot, he was hardly ever seen in garments not reflective of the red, white and black colours of TT's national flag.\n\nGordon was among the mourners who took to Facebook to pay tribute.\n\n\"Peter has given so many gifts to us as a church. We have lost a great Catholic and a true patriot of TT. May we continue to pray for his family during this time and for the eternal rest of his soul. #RestinPeace.\"\n\nThe Catholic News also acknowledged the musical contributions of Telfer and the Mawasi Experience to the Catholic community and many local, cultural productions.\n\n\"He was the creative coordinator, drummer, percussionist and composer. For many years the group practised for performances at the Sacred Heart RC Church, Port of Spain where they kept their musical instruments.\n\n\"Every month, Mawasi added to the liturgy at the church's 11 am Sunday masses. Telfer founded Mawasi Experience on Sunday October 12, 1980, and over the years they produced new liturgical music with a Caribbean feel.\"\n\nThe Ministry of Tourism, Culture and the Arts where he worked as a cultural officer, also joined the national cultural fraternity in celebrating Telfer's life.\n\nMitchell also sent a message of condolence.\n\n\"Mr Telfer's passing was a great loss and his talent and passion for the arts certainly made TT's cultural landscape even richer.\n\n\"He was not only a cultural icon, but a patriot, a gifted drummer, and a composer who always displayed his national pride and was always adorned in red, white and black.\n\n\"As a cultural officer with the former Ministry of Community Development, Culture and the Arts, his colleagues fondly remembered Peter as someone who not only worked in the administration of the sector, but was also passionate about the advancement of culture and the arts in TT. This he made his life's work.\"\n\nIn extending condolences to Telfer's family, his Mawasi Experience band members and the cultural fraternity, Mitchell also expressed his heartfelt thanks to them for his contribution to the arts and culture.\n\n\"We thank you for allowing Peter to share his time, talent and his passion with all of TT. He will indeed be missed.\"",
                "source": {
                    "uri": "newsday.co.tt",
                    "dataType": "news",
                    "title": "Trinidad and Tobago Newsday"
                },
                "authors": [
                    {
                        "uri": "yvonne_webb@newsday.co.tt",
                        "name": "Yvonne Webb",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": "https://newsday.co.tt/wp-content/uploads/2021/10/16443710.jpg",
                "eventUri": null,
                "sentiment": 0.4274509803921569,
                "wgt": 372038340,
                "relevance": 2
            },
            {
                "uri": "p-6770363748",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:59:00",
                "dateTime": "2021-10-15T23:59:00Z",
                "dateTimePub": "2021-10-15T23:59:00Z",
                "dataType": "pr",
                "sim": 0,
                "url": "https://www.businesswire.com/news/home/20211015005639/en/TherapeuticsMD-Announces-Appointment-of-Mark-Glickman-as-Chief-Business-Officer/?feedref=JjAwJuNHiystnCoBq_hl-W4H1IlNmEqsA_QsKxmUu10JzdEKfaKgqbAFlu1RP-VrGUIFL7qUAtPN67MyiuyqVQFFcEhsR9L4vtsWSruU9uq1nQgPLLOe8LDyS6rGb2F0",
                "title": "TherapeuticsMD Announces Appointment of Mark Glickman as Chief Business Officer",
                "body": "BOCA RATON, Fla.--(BUSINESS WIRE)--TherapeuticsMD, Inc. (NASDAQ: TXMD), an innovative, leading women's healthcare company, today announced the appointment of Mark Glickman as the Company's Chief Business Officer.\n\nMr. Glickman previously served as Chief Commercial Officer of Esperion and Aralez Pharmaceuticals, and Executive Vice President, Sales and Marketing, of Auxilium Pharmaceuticals, among other global pharmaceutical roles. Mr. Glickman received his MBA in Finance and International Management from New York University and his BA from State University of New York College at Oswego.\n\nInducement Grant Under Nasdaq Listing Rule 5635(c)(4)\n\nAs a material inducement to Mr. Glickman's acceptance of the appointment, TherapeuticsMD granted Mr. Glickman an award of 660,000 restricted stock units (\"RSUs\") and 260,000 performance stock units (\"PSUs\") corresponding to shares of common stock of the Company, outside of the Company's 2019 Stock Incentive Plan (the \"2019 Plan\"). 400,000 of the RSUs will vest at the end of three years, and 260,000 of the RSUs will vest in equal annual installments over three years beginning October 15, 2022, in each case subject to Mr. Glickman's continuous service with the Company. The PSUs will vest based on certain performance metrics related to revenue and the timing in which the Company achieves EBITDA break even, and are subject to Mr. Glickman's continuous service with the Company. The actual number of PSUs that will vest will be between zero and two times the base number of PSUs depending on the milestones achieved. The inducement grant was approved on October 15, 2021 by a majority of the independent directors of the Company's Board of Directors in reliance on the employment inducement exception to shareholder approval provided under NASDAQ Stock Market Listing Rule 5635(c)(4).\n\nAbout TherapeuticsMD, Inc.\n\nTherapeuticsMD, Inc. is an innovative, leading healthcare company, focused on developing and commercializing novel products exclusively for women. Our products are designed to address the unique changes and challenges women experience through the various stages of their lives with a therapeutic focus in family planning, reproductive health, and menopause management. The company is committed to advancing the health of women and championing awareness of their healthcare issues. To learn more about TherapeuticsMD, please visit therapeuticsmd.com or follow us on Twitter: @TherapeuticsMD and on Facebook: TherapeuticsMD.\n\nForward-Looking Statements\n\nThis press release by TherapeuticsMD, Inc. may contain forward-looking statements. Forward-looking statements may include, but are not limited to, statements relating to TherapeuticsMD's objectives, plans and strategies as well as statements, other than historical facts, that address activities, events or developments that the company intends, expects, projects, believes or anticipates will or may occur in the future. These statements are often characterized by terminology such as \"believes,\" \"hopes,\" \"may,\" \"anticipates,\" \"should,\" \"intends,\" \"plans,\" \"will,\" \"expects,\" \"estimates,\" \"projects,\" \"positioned,\" \"strategy\" and similar expressions and are based on assumptions and assessments made in light of management's experience and perception of historical trends, current conditions, expected future developments and other factors believed to be appropriate. Forward-looking statements in this press release are made as of the date of this press release, and the company undertakes no duty to update or revise any such statements, whether as a result of new information, future events or otherwise. Forward-looking statements are not guarantees of future performance and are subject to risks and uncertainties, many of which are outside of the company's control. Important factors that could cause actual results, developments and business decisions to differ materially from forward-looking statements are described in the sections titled \"Risk Factors\" in the company's filings with the Securities and Exchange Commission, including its most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, as well as reports on Form 8-K, and include the following: the effects of the COVID-19 pandemic; the company's ability to maintain or increase sales of its products; the company's ability to develop and commercialize IMVEXXY®, ANNOVERA®, and BIJUVA® and obtain additional financing necessary therefor; whether the company will be able to comply with the covenants and conditions under its term loan facility; whether the company will be able to successfully divest, or obtain an investment in, its vitaCare business and how the proceeds that may be generated by any such divestiture or investment will be utilized; the potential of adverse side effects or other safety risks that could adversely affect the commercialization of the company's current or future approved products or preclude the approval of the company's future drug candidates; whether the FDA will approve the lower dose of BIJUVA; the company's ability to protect its intellectual property, including with respect to the Paragraph IV notice letters the company received regarding IMVEXXY and BIJUVA; the length, cost and uncertain results of future clinical trials; the company's reliance on third parties to conduct its manufacturing, research and development and clinical trials; the ability of the company's licensees to commercialize and distribute the company's products; the ability of the company's marketing contractors to market ANNOVERA; the availability of reimbursement from government authorities and health insurance companies for the company's products; the impact of product liability lawsuits; the influence of extensive and costly government regulation; the volatility of the trading price of the company's common stock and the concentration of power in its stock ownership.",
                "source": {
                    "uri": "businesswire.com",
                    "dataType": "pr",
                    "title": "Business Wire"
                },
                "authors": [],
                "image": "http://www.businesswire.com/images/bwlogo_square.png",
                "eventUri": null,
                "sentiment": 0.2392156862745098,
                "wgt": 372038340,
                "relevance": 1
            },
            {
                "uri": "6770361891",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:57:00",
                "dateTime": "2021-10-15T23:57:00Z",
                "dateTimePub": "2021-10-15T23:55:00Z",
                "dataType": "news",
                "sim": 0.6784313917160034,
                "url": "https://www.bullfrag.com/how-to-share-multiple-responses-in-the-same-instagram-story/",
                "title": "How to share multiple responses in the same Instagram story",
                "body": "Without a doubt, Instagram is one of the most important social networks today, it is known for its multiple functions, among which we can highlight Stories. If you are interested in knowing more about Instagram Stories, this tutorial on How to quickly share several responses in the same Instagram Stories can be very useful.\n\nThe Instagram Stories questions are quite useful to have an exchange with our followers, in fact with them it is possible to share Instagram stories on Facebook. It is for this reason that most influencers tend to use them constantly to answer multiple questions.\n\nThe Instagram application has been evolving little by little with the needs of its users. In this globalized world, sharing our moments and thoughts with others is something more and more common, you can expand this with Instagram stories.\n\nWith this function, it is possible to share videos, and if you have enough ingenuity you can also learn to upload longer videos in Instagram Stories, without a doubt it is an invaluable tool for those who handle social networks.\n\nInstagram Stories are one of the main means of reach of a user with his followers. There are also multiple tools present in this section of the application, one of them is the questions.\n\nOn the other hand, Instagram Stories questions allow direct contact between user and follower, so that there is constant feedback. Use this tool to communicate better with your followers. We also invite you to read our tutorial to take better advantage of this section of Instagram.\n\nHere you will learn the easiest way to share the responses of your followers. It is a basic process that anyone can do in just a few steps. Read carefully the information we have for you and improve communication with your followers on Instagram.\n\nAt the moment the Instagram application does not allow you to post many responses at the same time. Anyway, with a little ingenuity, it is possible to do this, follow our method to share multiple answers in the same story.\n\nIn addition to the above, it is possible to create and answer questions with music in your stories, in this way what you share will be much more striking for the people who follow you.",
                "source": {
                    "uri": "bullfrag.com",
                    "dataType": "news",
                    "title": "Bullfrag"
                },
                "authors": [],
                "image": "https://static.digit.in/default/4e8d47409d8e36d209757f54acfbc30cd4d1a636.jpeg",
                "eventUri": "eng-7185127",
                "sentiment": 0.3490196078431373,
                "wgt": 372038220,
                "relevance": 1
            },
            {
                "uri": "6770362288",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:56:00",
                "dateTime": "2021-10-15T23:56:00Z",
                "dateTimePub": "2021-10-15T23:47:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://www.wowktv.com/news/west-virginia/west-virginias-bridge-day-2021-to-be-celebrated-virtually/",
                "title": "West Virginia's Bridge Day 2021 to be celebrated virtually",
                "body": "FAYETTEVILLE, WV (WVNS) -- After announcing the cancellation of one of West Virginia's largest events, the Fayette County Chamber of Commerce decided to celebrate Bridge Day virtually this year by asking the public to share their favorite Bridge Day memories.\n\nThe event will be held Saturday, October 16th. This is the second year in a row the event is being held virtually. Bridge Day will be celebrated through social media, and contests will be running on Facebook only from 9 a.m. until 3 p.m. The Chair for the Bridge Day Commission, Becky Sullivan, said a total of five grand prizes will be given away.\n\n\"You can sit on your couch, you can drive around in your vehicle, you can drive across the bridge, drive down to the river and watch us celebrate virtual Bridge Day,\" Sullivan said.\n\nIf you would like a t-shirt for this year's virtual bridge day, links to purchase one will be on Bridge Day's social media and website.",
                "source": {
                    "uri": "wowktv.com",
                    "dataType": "news",
                    "title": "WOWK 13 Huntington"
                },
                "authors": [
                    {
                        "uri": "jessica_schueler@wowktv.com",
                        "name": "Jessica Schueler",
                        "type": "author",
                        "isAgency": false
                    }
                ],
                "image": "https://www.wowktv.com/wp-content/uploads/sites/52/2021/10/d0aa3df0b3014beda5e9c3c57fe50bf5.jpg?w=1280",
                "eventUri": null,
                "sentiment": 0.4352941176470588,
                "wgt": 372038160,
                "relevance": 1
            },
            {
                "uri": "6770361315",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:56:00",
                "dateTime": "2021-10-15T23:56:00Z",
                "dateTimePub": "2021-10-15T23:00:00Z",
                "dataType": "news",
                "sim": 0.6705882549285889,
                "url": "https://mainichi.jp/english/articles/20211015/p2a/00m/0na/010000c",
                "title": "Adult stress seen linked to record high child suicides in Japan: education ministry",
                "body": "TOKYO -- The number of suicides among elementary, junior high and senior high school students in Japan in the 2020 school year increased by 98 from the previous academic year to 415, the highest ever recorded, according to a survey on students' problematic behavior and refusal to attend classes by the education ministry.\n\nA Ministry of Education, Culture, Sports, Science and Technology representative said, \"As in the previous school year, the reason for many of the suicides is believed to lie within the household. This is probably a result of adults directing their stress caused by the coronavirus pandemic onto kids.\"\n\nThe number of suicides stood at seven among elementary school children, up three from the previous academic year, 103 among junior high school students, up 12 from fiscal 2019, and 305 among senior high school students, up 83 from the 2019 school year. The increase in suicides among high school students is especially high.\n\nTo a question allowing multiple answers about the causes of suicides found by school investigations, family discord was the most common reason, cited in 53 cases, followed by mental illness in 46 instances, issues over career paths in 44, and rebukes from parents and others in 33. However, \"unknown causes\" accounted for 218 of the 415 cases, highlighting the difficulty in identifying the cause.\n\nRegarding the number of suicides among children and students, it has long been pointed out that statistical data composed by the education ministry and the National Policy Agency is inconsistent. This time, the agency reported 507 such cases -- 92 more than the figure announced by the education ministry.\n\nAccording to the ministry, some families are reluctant to reveal their child's suicide. The representative explained, \"It is difficult for a school, which doesn't have investigative authority, to keep track of all cases.\"\n\n(Japanese original by Akira Okubo, Tokyo City News Department)\n\n-- Suicide prevention hotline in Japan with English support\n\nA selection of emergency numbers with multilingual support is also provided at the bottom of their home page.\n\n*Operating hours for the telephone hotline and online chat depend on the day and are subject to change. Check the Facebook page linked below for up-to-date information:",
                "source": {
                    "uri": "mainichi.jp",
                    "dataType": "news",
                    "title": "毎日新聞"
                },
                "authors": [],
                "image": "https://cdn.mainichi.jp/vol1/2021/10/15/20211015p2a00m0na009000p/0c10.jpg?1",
                "eventUri": "eng-7185128",
                "sentiment": -0.1372549019607843,
                "wgt": 372038160,
                "relevance": 1
            },
            {
                "uri": "6770362148",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:56:00",
                "dateTime": "2021-10-15T23:56:00Z",
                "dateTimePub": "2021-10-15T23:45:00Z",
                "dataType": "news",
                "sim": 0.929411768913269,
                "url": "https://www.wallstreet-online.de/nachricht/14539755-view-deadline-notice-rosen-global-investor-counsel-encourages-view-inc-f-k-a-cf-finance-acquisition-corp-ii-investors-with-losses-excess-of-100k-to-secure-counsel-before-october-18-deadline-securities-class-action-view-cfii",
                "title": "ROSEN, GLOBAL INVESTOR COUNSEL, Encourages View, Inc. f/k/a CF Finance Acquisition Corp. II Investors with Losses in Excess of $100K to Secure Counsel Before Important October 18 Deadline in Securities Class Action - VIEW, CFII",
                "body": "WHAT TO DO NEXT: To join the View class action, go to http://www.rosenlegal.com/cases-register-2146.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than October 18, 2021. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.\n\nWHY ROSEN LAW: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources, or any meaningful peer recognition. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs' Bar. Many of the firm's attorneys have been recognized by Lawdragon and Super Lawyers.\n\nDETAILS OF THE CASE: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) View had not properly accrued warranty costs related to its product; (2) there was a material weakness in View's internal controls over accounting and financial reporting related to warranty accrual; (3) as a result, the Company's financial results for prior periods were misstated; and (4) as a result, defendants' statements about View's business, operations, and prospects were materially false and misleading and/or lacked reasonable basis at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages.\n\nTo join the View class action, go to http://www.rosenlegal.com/cases-register-2146.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email pkim@rosenlegal.com or cases@rosenlegal.com for information on the class action.\n\nNo Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.\n\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm, on Twitter: https://twitter.com/rosen_firm or on Facebook: https://www.facebook.com/rosenlawfirm/.\n\nAttorney Advertising. Prior results do not guarantee a similar outcome.",
                "source": {
                    "uri": "wallstreet-online.de",
                    "dataType": "news",
                    "title": "wallstreet:online"
                },
                "authors": [],
                "image": "https://assets.wallstreet-online.de/_media/6/nachrichtenfeeds/size_645/logo-business-wire-engl.png",
                "eventUri": "eng-7184816",
                "sentiment": 0.2392156862745098,
                "wgt": 372038160,
                "relevance": 1
            },
            {
                "uri": "6770361748",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:55:00",
                "dateTime": "2021-10-15T23:55:00Z",
                "dateTimePub": "2021-10-15T23:52:00Z",
                "dataType": "news",
                "sim": 0.7490196228027344,
                "url": "https://chinapost.nownews.com/20211016-2831494",
                "title": "Seahawks put Russell Wilson, Chris Carson on injured reserve | The China Post, Taiwan",
                "body": "Seahawks put Russell Wilson, Chris Carson on injured reserve October 16, 2021 Share LINE Facebook Twitter Telegram WhatsApp Linkedin ReddIt Digg Email Print\n\nRENTON, Wash. (AP) -- The Seattle Seahawks placed quarterback Russell Wilson and running back Chris Carson on injured reserve Friday, a move that will keep both players out until at least mid-November.\n\nCoach Pete Carroll had said earlier in the day that Wilson would be placed on IR and the team was considering a similar move with Carson due to a lingering neck issue.\n\nBoth players will be unavailable at least until Seattle's game on Nov. 14 against Green Bay.\n\nWilson is recovering from surgery on his right middle finger. Wilson has started every game of his career -- 165 games regular season and playoffs combined -- until now.\n\nThe Week 10 matchup with the Packers will be five weeks following Wilson's surgery. Geno Smith will start this week for the Seahawks.\n\n\"I'm hoping that he'll feel really comfortable in the game, because he looks great in practice and everything's gone well,\" Carroll said of Smith.\n\nWhile the move with Wilson was expected, the week started with optimism that Carson would be able to play after he missed last week with a neck issue. At first, Carroll was hopeful that Carson would practice late in the week, but he was a nonparticipant all week.\n\n\"It is a delicate thing. He's got something going on in his neck, so we've got to make sure that we do it really well,\" Carroll said. \"And so we're going to take care of him and this just seems like the right decision.\"\n\nCarson is Seattle's leading rusher with 232 yards and three touchdowns in his four games played. Alex Collins will start for the second straight week and Seattle expects Rashaad Penny to return from injured reserve in the next couple of weeks.\n\nSeattle activated offensive lineman Ethan Pocic and rookie cornerback Tre Brown from injured reserve to take the open roster spots. Both could end up getting playing time against the Steelers.\n\nMore AP NFL coverage: https://apnews.com/hub/NFL and https://twitter.com/AP_NFL\n\nShare LINE Facebook Twitter Telegram WhatsApp Linkedin ReddIt Digg Email Print Previous articleQAnon figure says he's running for Congress in Arizona 龔向華",
                "source": {
                    "uri": "chinapost.nownews.com",
                    "dataType": "news",
                    "title": "The China Post, Taiwan"
                },
                "authors": [],
                "image": "https://chinapost-media.nownews.com/2021/10/422875b2-preview.jpg",
                "eventUri": "eng-7181060",
                "sentiment": 0.1215686274509804,
                "wgt": 372038100,
                "relevance": 2
            },
            {
                "uri": "6770361222",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:55:00",
                "dateTime": "2021-10-15T23:55:00Z",
                "dateTimePub": "2021-10-15T23:54:00Z",
                "dataType": "news",
                "sim": 0.7254902124404907,
                "url": "https://www.independent.co.uk/news/world/americas/us-politics/texas-schools-books-opposing-holocaust-b1939480.html",
                "title": "Texas officials sorry for advising teachers to include 'opposing views' on Holocaust",
                "body": "Texas education official says schools must have books with 'opposing views' on the Holocaust\n\nSchool administrators in Texas have apologised for telling teachers that they needed to teach \"opposing perspectives\" about the Holocaust due to new laws aimed at curbing \"critical race theory\" in the classroom.\n\nGina Peddy, curriculum director for the Carroll Independent School District in Southlake, Texas, had reportedly warned teachers at a training meeting last Friday that they must balance books about the Nazi genocide with other books taking the opposite view.\n\nBut in a Facebook post on on Thursday, district superintendent Lane Ledbetter apologised to families and teachers affirming that \"there are not two sides of the Holocaust\".\n\nMr Ledbetter said: \"As the superintendent of schools, I express my sincere apology regarding the online article and news story released today.\n\n\"During the conversations with teachers during last week's meeting, the comments made were in no way to convey that the Holocaust was anything less than a terrible event in history. Additionally, we recognise there are not two sides of the Holocaust.\n\n\"As we continue to work through implementation of [Texas House Bill] 3979, we also understand this bill does not require an opposing viewpoint on historical facts. As a district we will work to add clarity to our expectations for teachers and once again apologise for any hurt or confusion this has caused.\"\n\nHouse Bill 3979 is a Texas state law that dictates how teachers in the state talk to their students about current affairs and the country's history of racism. It is largely seen as an attempt to ban discourse around critical race theory, an academic term to describe how race and racism have impacted social structures in the US.\n\nMany GOP leaders have over the past year decried the teaching of critical race theory. The bill, signed into law by governor Greg Abbott in June this year, requires teachers discussing \"widely debated and currently controversial\" topics to provide \"diverse and contending perspectives without giving deference to any one perspective\".\n\nIn an audio recording reported by NBC News, Ms Peddy attempted to explain the requirements by saying: \"Make sure that if you have a book on the Holocaust, that you have one that has an opposing, that has other perspectives.\"\n\nOne teacher asked: \"How do you oppose the Holocaust?\" Ms Peddy responded: \"Believe me, that's come up.\"\n\nThe Holocaust was the systematic and state-sponsored genocide of Jews by the Nazi regime and its allies. According to the US Holocaust Memorial Museum and estimates by various scholars, nearly six million Jews were killed in Europe at this time.\n\nFollowing the comments from Ms Peddy, Democratic senator José Menéndez sent a letter to Texas's education commissioner seeking \"immediate action\" to \"refute hateful and racist rhetoric in\" Texas public schools and a \"thorough review\" of how they are implementing House Bill 3979.\n\n\"This is disturbing and a flagrant violation of keeping an open and healthy learning environment in our schools,\" he wrote. \"When this bill passed legislators warned that racist attacks would occur. It is our job to take every step possible to ensure an open and diverse forum, without subjecting our children to racism and [hateful] rhetoric.\"\n\nThe reports saw huge outrage from Democratic politicians including congresswoman Alexandria Ocasio-Cortez and senator Chris Murphy.\n\n\"There's a reason white supremacy attacks history,\" wrote Ms Ocasio-Cortez on Twitter. \"Opposition to teaching bigotry's history and where it leads - from the slave trade to the Holocaust - is about erasing society's tools to recognise prejudice and prevent atrocity. Holocaust denial has no place in our society. None.\"\n\nCalling the situation \"a little out of hand\", Mr Murphy tweeted: \"So let me get this straight - the non-existent threat of 'critical race theory' has caused Texas to mandate the teaching of Holocaust denial? This seems to be getting A LITTLE out of hand.\"\n\nAuthor Neil Gaiman also expressed his outrage and said: \"So if Texas teaches books that oppose the Holocaust... they also need Mein Kampf on their school bookshelves? Or just books that say the Jews deserved it?\"",
                "source": {
                    "uri": "independent.co.uk",
                    "dataType": "news",
                    "title": "The Independent"
                },
                "authors": [],
                "image": "https://static.independent.co.uk/2020/10/05/15/iStock-1162957575.jpg?width=1200&auto=webp&quality=75",
                "eventUri": "eng-7182095",
                "sentiment": -0.07450980392156858,
                "wgt": 372038100,
                "relevance": 1
            },
            {
                "uri": "6770361387",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:55:00",
                "dateTime": "2021-10-15T23:55:00Z",
                "dateTimePub": "2021-10-15T23:06:00Z",
                "dataType": "news",
                "sim": 0.5686274766921997,
                "url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2021/10/15/davenport-officer-identified-fatal-police-shooting-suspect/8475639002/",
                "title": "Authorities identify Davenport police officer who fatally shot 'wanted and armed' man",
                "body": "Authorities have identified a Davenport police officer who fatally shot a man described as wanted by law enforcement earlier this week.\n\nOfficer Mason Roth fatally shot Bobby Jo Klum, 37, of Scott County on Oct. 13.\n\nDavenport police described Klum as a \"wanted and armed individual,\" but did not disclose why Klum was wanted by law enforcement. Klum was allegedly seen walking with a handgun to his head near the intersection of 8th and Iowa streets on Wednesday when Roth and numerous other officers responded to the scene.\n\nA video posted on Facebook by a witness, and reviewed by the Des Moines Register, shows Klum with what appears to be a handgun to his head walking away from police as officers yell \"get out of the street,\" \"get out of here,\" \"go inside\" and \"go to your house.\"\n\nAccording to police, two less-lethal rounds were discharged at Klum before Roth shot him in his mid-torso. Klum was transported to a local hospital, where he was pronounced dead.\n\nRoth has worked with the Davenport Police Department for four years, according to the Iowa Department of Public Safety.\n\nThe officer has been placed on paid administrative leave pending Iowa Division of Criminal Investigation investigation, per department policy.\n\nInvestigators did not immediately respond to requests for comment.",
                "source": {
                    "uri": "desmoinesregister.com",
                    "dataType": "news",
                    "title": "Des Moines Register"
                },
                "authors": [],
                "image": "https://www.gannett-cdn.com/-mm-/cf590beeec04e793cbf8e7ec6bbd1a1289afc9ba/c=0-15-1440-825/local/-/media/2017/07/14/DesMoines/B9328406778Z.1_20170714145854_000_GLTIVAE95.1-0.jpg?auto=webp&format=pjpg&width=1200",
                "eventUri": "eng-7181949",
                "sentiment": -0.207843137254902,
                "wgt": 372038100,
                "relevance": 1
            },
            {
                "uri": "6770360860",
                "lang": "eng",
                "isDuplicate": false,
                "date": "2021-10-15",
                "time": "23:54:00",
                "dateTime": "2021-10-15T23:54:00Z",
                "dateTimePub": "2021-10-15T23:53:00Z",
                "dataType": "news",
                "sim": 0,
                "url": "https://www.khmertimeskh.com/50952921/9th-anniversary-of-king-fathers-passing-commemorated/",
                "title": "9th anniversary of King-Father's passing commemorated - Khmer Times",
                "body": "Click here to get Khmer Times Breaking News direct into your Telegram\n\nCambodia commemorates the 9th year anniversary of His Majesty the King-Father Samdech Preah Norodom Sihanouk (Preah Borom Ratanak Kaudh)'s passing.\n\nThis morning in Phnom Penh, high-ranking delegations of the Senate, National Assembly and government as well as ministries and institutions took turn to lay wreaths at the late King-Father's Memorial Statue, located in a public park, east of the Monument of Independence in Phnom Penh.\n\nMeanwhile, municipal and provincial authorities also held ceremonies to pray for the soul of Preah Borom Ratanak Kaudh.\n\nIn a message posted on his official Facebook post this morning, Prime Minister Hun Sen expressed his sincere gratitude to His Majesty the late King-Father, stressing that the Cambodian people of all walks of life will never forget his royal sacrifice for the supreme interest of the nation, and wished his soul rest in peace.\n\nHis Majesty the King-Father Norodom Sihanouk passed away on Oct. 15, 2012 at 01:20 am (time in Phnom Penh) in Beijing, China at the age of 90 from natural causes.\n\nOctober 15 is set to be a national holiday in Cambodia to commemorate the late King-Father's sacrifice for the nation.\n\nNorodom Sihanouk was born on Oct. 31, 1922. He was the only son of HRH Prince Norodom Suramarit and HRH Princess Sisowath Kossomak Nearirath Serey Vatthana.\n\nNorodom Sihanouk became the King of the Kingdom of Cambodia in April 1941. He led Cambodia for the full independence from France in 1953.\n\nIn 1955, Norodom Sihanouk abdicated to his father and founded the Sangkum Reastr Niyum (SRN), a country development movement. It won a great victory in the legislative election. At that time, Norodom Sihanouk became the prime minister of Cambodia, and head of state of Cambodia in 1960 after the death of his father.\n\nOn Mar. 18, 1970 during the official visit to the USSR, Preah Norodom Sihanouk was ousted from the power by a Coup d'Etat. Then he became the President of the Cambodian resistance (FUNK).\n\nIn April 1975, Norodom Sihanouk became the head of state of Democratic Kampuchea (Khmer Rouge regime), but he resigned in 1976.\n\nFrom the fall of the Democratic Kampuchea on Jan. 7, 1979 to 1990, Samdech Preah Norodom Sihanouk stayed out of the country and returned back in 1991 and became the King of Cambodia in 1993 until he abdicated in October 2004.\n\nAfter the abdication, he often stayed in China for his medical treatment until he passed away. C. Nika - AKP",
                "source": {
                    "uri": "khmertimeskh.com",
                    "dataType": "news",
                    "title": "Khmer Times"
                },
                "authors": [],
                "image": "https://www.khmertimeskh.com/wp-content/uploads/2021/10/287A3624.jpg",
                "eventUri": null,
                "sentiment": 0.2313725490196079,
                "wgt": 372038040,
                "relevance": 1
            }
        ]
    }
}